{
  "architectures": [
    "RobertaForMaskedLM"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.3,
  "hidden_size": 128,
  "initializer_range": 0.02,
  "intermediate_size": 256,
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 256,
  "model_type": "roberta",
  "num_attention_heads": 1,
  "num_hidden_layers": 1,
  "pad_token_id": 1,
  "type_vocab_size": 2,
  "vocab_size": 5000
}
